results/4-loadtest/aws_results/aws_go_100.txt
Running 1m test @ https://zz5urfwt50.execute-api.eu-central-1.amazonaws.com/test/go_matrix
  2 threads and 100 connections
  Thread calibration: mean lat.: 62.146ms, rate sampling interval: 395ms
  Thread calibration: mean lat.: 55.362ms, rate sampling interval: 339ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.91ms   17.90ms 511.49ms   97.27%
    Req/Sec    49.40     64.62   147.00     65.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   41.28ms
 75.000%   46.85ms
 90.000%   51.68ms
 99.000%   67.58ms
 99.900%  321.28ms
 99.990%  511.74ms
 99.999%  511.74ms
100.000%  511.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.631     0.000000            1         1.00
      30.943     0.100000          496         1.11
      32.415     0.200000          985         1.25
      34.207     0.300000         1477         1.43
      36.703     0.400000         1965         1.67
      41.279     0.500000         2453         2.00
      42.783     0.550000         2696         2.22
      43.871     0.600000         2941         2.50
      44.799     0.650000         3186         2.86
      45.695     0.700000         3431         3.33
      46.847     0.750000         3678         4.00
      47.487     0.775000         3798         4.44
      48.223     0.800000         3928         5.00
      48.991     0.825000         4049         5.71
      49.855     0.850000         4165         6.67
      50.687     0.875000         4291         8.00
      51.167     0.887500         4349         8.89
      51.679     0.900000         4410        10.00
      52.287     0.912500         4473        11.43
      53.055     0.925000         4533        13.33
      54.175     0.937500         4595        16.00
      54.815     0.943750         4627        17.78
      55.423     0.950000         4655        20.00
      56.543     0.956250         4687        22.86
      57.599     0.962500         4718        26.67
      58.847     0.968750         4747        32.00
      59.711     0.971875         4763        35.56
      60.255     0.975000         4778        40.00
      60.575     0.978125         4793        45.71
      60.863     0.981250         4809        53.33
      62.367     0.984375         4825        64.00
      62.943     0.985938         4833        71.11
      63.935     0.987500         4839        80.00
      65.791     0.989062         4847        91.43
      74.431     0.990625         4855       106.67
      78.207     0.992188         4862       128.00
      84.095     0.992969         4866       142.22
      88.447     0.993750         4870       160.00
     102.911     0.994531         4874       182.86
     111.743     0.995313         4878       213.33
     132.351     0.996094         4881       256.00
     158.975     0.996484         4883       284.44
     160.511     0.996875         4885       320.00
     162.815     0.997266         4887       365.71
     168.063     0.997656         4889       426.67
     186.751     0.998047         4891       512.00
     197.759     0.998242         4892       568.89
     221.695     0.998437         4893       640.00
     305.407     0.998633         4894       731.43
     321.279     0.998828         4895       853.33
     366.079     0.999023         4896      1024.00
     366.079     0.999121         4896      1137.78
     394.495     0.999219         4897      1280.00
     394.495     0.999316         4897      1462.86
     413.183     0.999414         4898      1706.67
     413.183     0.999512         4898      2048.00
     413.183     0.999561         4898      2275.56
     506.879     0.999609         4899      2560.00
     506.879     0.999658         4899      2925.71
     506.879     0.999707         4899      3413.33
     506.879     0.999756         4899      4096.00
     506.879     0.999780         4899      4551.11
     511.743     0.999805         4900      5120.00
     511.743     1.000000         4900          inf
#[Mean    =       41.908, StdDeviation   =       17.896]
#[Max     =      511.488, Total count    =         4900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5903 requests in 1.00m, 3.15MB read
Requests/sec:     98.33
Transfer/sec:     53.68KB