results/4-loadtest/aws_results/aws_go_1000.txt
Running 1m test @ https://zz5urfwt50.execute-api.eu-central-1.amazonaws.com/test/go_matrix
  2 threads and 1000 connections
  Thread calibration: mean lat.: 188.098ms, rate sampling interval: 1262ms
  Thread calibration: mean lat.: 203.897ms, rate sampling interval: 1281ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.99ms   39.89ms 651.78ms   93.35%
    Req/Sec   501.84     59.84   619.00     65.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   46.85ms
 75.000%   63.84ms
 90.000%   86.21ms
 99.000%  151.04ms
 99.900%  525.82ms
 99.990%  628.73ms
 99.999%  652.29ms
100.000%  652.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      26.815     0.000000            1         1.00
      32.463     0.100000         4700         1.11
      34.303     0.200000         9450         1.25
      36.799     0.300000        14105         1.43
      43.231     0.400000        18799         1.67
      46.847     0.500000        23479         2.00
      48.767     0.550000        25834         2.22
      51.423     0.600000        28167         2.50
      55.071     0.650000        30530         2.86
      58.943     0.700000        32866         3.33
      63.839     0.750000        35222         4.00
      66.687     0.775000        36383         4.44
      69.695     0.800000        37566         5.00
      72.575     0.825000        38753         5.71
      75.775     0.850000        39904         6.67
      80.831     0.875000        41089         8.00
      83.711     0.887500        41670         8.89
      86.207     0.900000        42252        10.00
      88.831     0.912500        42839        11.43
      92.479     0.925000        43433        13.33
      97.983     0.937500        44020        16.00
     100.415     0.943750        44309        17.78
     103.167     0.950000        44599        20.00
     106.623     0.956250        44893        22.86
     111.999     0.962500        45185        26.67
     117.311     0.968750        45481        32.00
     119.359     0.971875        45628        35.56
     122.815     0.975000        45774        40.00
     126.719     0.978125        45919        45.71
     130.303     0.981250        46066        53.33
     134.143     0.984375        46212        64.00
     136.831     0.985938        46286        71.11
     139.775     0.987500        46359        80.00
     146.687     0.989062        46435        91.43
     156.799     0.990625        46505       106.67
     200.575     0.992188        46579       128.00
     240.383     0.992969        46616       142.22
     344.831     0.993750        46652       160.00
     366.591     0.994531        46690       182.86
     380.159     0.995313        46725       213.33
     407.039     0.996094        46762       256.00
     429.823     0.996484        46782       284.44
     440.575     0.996875        46800       320.00
     451.583     0.997266        46819       365.71
     485.119     0.997656        46835       426.67
     493.311     0.998047        46855       512.00
     495.871     0.998242        46864       568.89
     500.223     0.998437        46872       640.00
     504.319     0.998633        46881       731.43
     512.767     0.998828        46890       853.33
     527.359     0.999023        46900      1024.00
     534.015     0.999121        46904      1137.78
     538.111     0.999219        46909      1280.00
     550.399     0.999316        46913      1462.86
     572.415     0.999414        46919      1706.67
     583.679     0.999512        46923      2048.00
     589.311     0.999561        46925      2275.56
     597.503     0.999609        46927      2560.00
     602.111     0.999658        46929      2925.71
     607.231     0.999707        46933      3413.33
     607.743     0.999756        46934      4096.00
     609.279     0.999780        46935      4551.11
     611.839     0.999805        46936      5120.00
     616.447     0.999829        46937      5851.43
     628.223     0.999854        46939      6826.67
     628.735     0.999878        46940      8192.00
     628.735     0.999890        46940      9102.22
     630.271     0.999902        46941     10240.00
     630.271     0.999915        46941     11702.86
     637.439     0.999927        46942     13653.33
     638.975     0.999939        46943     16384.00
     638.975     0.999945        46943     18204.44
     638.975     0.999951        46943     20480.00
     638.975     0.999957        46943     23405.71
     643.071     0.999963        46944     27306.67
     643.071     0.999969        46944     32768.00
     643.071     0.999973        46944     36408.89
     643.071     0.999976        46944     40960.00
     643.071     0.999979        46944     46811.43
     652.287     0.999982        46945     54613.33
     652.287     1.000000        46945          inf
#[Mean    =       55.987, StdDeviation   =       39.887]
#[Max     =      651.776, Total count    =        46945]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58627 requests in 1.00m, 31.25MB read
Requests/sec:    976.85
Transfer/sec:    533.26KB