results/4-loadtest/aws_results/aws_go_200.txt
Running 1m test @ https://zz5urfwt50.execute-api.eu-central-1.amazonaws.com/test/go_matrix
  2 threads and 200 connections
  Thread calibration: mean lat.: 79.444ms, rate sampling interval: 363ms
  Thread calibration: mean lat.: 76.733ms, rate sampling interval: 394ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.40ms   16.67ms 198.27ms   88.94%
    Req/Sec    99.05    123.73   275.00     65.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   44.42ms
 75.000%   51.97ms
 90.000%   60.29ms
 99.000%  106.05ms
 99.900%  165.63ms
 99.990%  189.31ms
 99.999%  198.40ms
100.000%  198.40ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.263     0.000000            1         1.00
      32.895     0.100000          988         1.11
      35.231     0.200000         1961         1.25
      37.855     0.300000         2950         1.43
      41.311     0.400000         3928         1.67
      44.415     0.500000         4913         2.00
      45.663     0.550000         5406         2.22
      47.039     0.600000         5887         2.50
      48.607     0.650000         6376         2.86
      50.143     0.700000         6860         3.33
      51.967     0.750000         7356         4.00
      52.895     0.775000         7612         4.44
      53.567     0.800000         7850         5.00
      54.271     0.825000         8092         5.71
      55.391     0.850000         8330         6.67
      57.471     0.875000         8579         8.00
      58.847     0.887500         8703         8.89
      60.287     0.900000         8820        10.00
      63.135     0.912500         8944        11.43
      67.519     0.925000         9065        13.33
      81.919     0.937500         9188        16.00
      84.799     0.943750         9250        17.78
      89.343     0.950000         9312        20.00
      92.671     0.956250         9373        22.86
      94.655     0.962500         9433        26.67
      96.895     0.968750         9494        32.00
      98.239     0.971875         9525        35.56
      99.583     0.975000         9555        40.00
     101.695     0.978125         9586        45.71
     102.591     0.981250         9621        53.33
     103.423     0.984375         9648        64.00
     104.703     0.985938         9664        71.11
     105.343     0.987500         9681        80.00
     105.663     0.989062         9696        91.43
     106.431     0.990625         9709       106.67
     107.519     0.992188         9724       128.00
     108.479     0.992969         9732       142.22
     109.183     0.993750         9739       160.00
     110.079     0.994531         9747       182.86
     111.551     0.995313         9755       213.33
     112.511     0.996094         9762       256.00
     115.007     0.996484         9766       284.44
     120.255     0.996875         9770       320.00
     135.039     0.997266         9774       365.71
     150.527     0.997656         9778       426.67
     159.871     0.998047         9781       512.00
     161.407     0.998242         9783       568.89
     164.735     0.998437         9786       640.00
     165.247     0.998633         9788       731.43
     165.375     0.998828         9789       853.33
     169.599     0.999023         9791      1024.00
     170.623     0.999121         9792      1137.78
     173.055     0.999219         9793      1280.00
     176.127     0.999316         9794      1462.86
     178.943     0.999414         9795      1706.67
     182.271     0.999512         9796      2048.00
     182.271     0.999561         9796      2275.56
     185.599     0.999609         9797      2560.00
     185.599     0.999658         9797      2925.71
     185.983     0.999707         9798      3413.33
     185.983     0.999756         9798      4096.00
     185.983     0.999780         9798      4551.11
     189.311     0.999805         9799      5120.00
     189.311     0.999829         9799      5851.43
     189.311     0.999854         9799      6826.67
     189.311     0.999878         9799      8192.00
     189.311     0.999890         9799      9102.22
     198.399     0.999902         9800     10240.00
     198.399     1.000000         9800          inf
#[Mean    =       47.397, StdDeviation   =       16.669]
#[Max     =      198.272, Total count    =         9800]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11804 requests in 1.00m, 6.29MB read
Requests/sec:    196.55
Transfer/sec:    107.30KB